Repository: sergiocabral/App.Suporte-Z
Catalog: src/suporte-z-cmd.cryptof/Properties/Comando.*.resx
Languages: pt_br

# msgConflitoCryptDecrypt
source: Unable to determine the action: crypt or decrypt? (choose only one)
pt_br: Não foi possível determinar a ação: crypt ou decrypt? (escolha uma só)

# msgConflitoSenhaClipboard
source: Unable to determine the source of the password: informed value or clipboard? (choose only one)
pt_br: Não foi possível determinar a origem da senha: valor informado ou área de transferência? (escolha um só)

# msgDescricao
source: The crypto command provides functions in the context\nof encryption for files and folders.
pt_br: O comando cryptof fornece funções no contexto\nda criptografia para arquivos e pastas.

# msgNecessarioIndicarAcao
source: You must choice one of the action arguments: {0} or {1}
pt_br: É necessário escolher um dos argumentos de ação: {0} ou {1}

# msgNecessarioIndicarSaida
source: You must choice one of the output arguments: {0} or {1}
pt_br: É necessário escolher um dos argumentos de saída: {0} ou {1}

# msgNenhumArquivoDeEntrada
source: No input file or folder was informed.
pt_br: Nenhum arquivo ou pasta de entrada foi informado.

# msgQuantidadeDeArquivosDeEntradaESaidaDevemSerIguais
source: The amount of file or folder output must be equal to the input.
pt_br: A quantidade de arquivo ou pastas de saída deve ser igual ao de entrada.

# optionAlgoritmoDeCriptografia
source: Symmetric encryption algorithm.\nValid options for VALUE:\n DES - uses 64-bit key\n RC2 - uses 128-bit key\n TripleDES - uses 192-bit key\n Rijndael - uses 256-bit key (default)
pt_br: Algoritmo de criptografia simétrica.\nOpções válidas para VALUE:\n DES - usa chave de 64 bits\n RC2 - usa chave de 128 bits\n TripleDES - usa chave de 192 bits\n Rijndael - usa chave de 256 bits (padrão)

# optionArquivoEntrada
source: File or folder input
pt_br: Arquivo ou pasta de entrada

# optionArquivoSaida
source: File or folder output
pt_br: Arquivo ou pasta de saída

# optionCriptografar
source: Action of encrypting
pt_br: Ação de criptografar

# optionDescriptografar
source: Action of decrypt
pt_br: Ação de descriptografar

# optionIntegrarComWindowsAtivado
source: Integrate this tool with Windows. View encryption option when right clicking on files and folders via Explorer.
pt_br: Integrar esta ferramenta com o Windows. Exibir opção de criptografia ao clicar com o botão direito nos arquivos e pastas pelo Explorer.

# optionIntegrarComWindowsDesativado
source: Disable Windows integration.
pt_br: Desativar integração com o Windows.

# optionInterfaceGrafica
source: Use graphical interface (GUI)
pt_br: Usa interface gráfica (GUI)

# optionSaidaNoMesmoArquivoDeEntrada
source: Causes the result of the encryption process overwrite the original file or folder.
pt_br: Faz com que o resultado do processo de criptografia sobreescreva o arquivo ou pasta original.

# optionSenha
source: Password applied in the encryption process
pt_br: Senha aplicada no processo de criptografia

# optionSenhaComoClipboard
source: Get from clipboard the password applied in the encryption process
pt_br: Obtem da área de transferência a senha aplicada no processo de criptografia
