Repository: sergiocabral/App.Suporte-Z
Catalog: src/suporte-z.cmd.crypto/Properties/Comando.*.resx
Languages: pt_br

# formPrincipal_buttonAcao_Hint
source: Performs the action...\neither encryption or decryption.
pt_br: Faz acontecer...\nseja criptografia ou descriptografia.

# formPrincipal_checkBoxAcaoAutomatico_Hint
source: When activated performs the process\nof encryption/decryption automatically.\n\nWhen disabled is necessary to activate\nthe button to start the process of\nencryption/decryption.
pt_br: Quando ativado realiza o processo de\ncriptografia/descriptografia automaticamente.\n\nQuando desativado torna necessário acionar\no botão para iniciar o processo\nde criptografia/descriptografia.

# formPrincipal_labelSenha
source: &Password
pt_br: Se&nha

# formPrincipal_labelValorEntrada
source: &Input value
pt_br: Valor de &entrada

# formPrincipal_labelValorSaida
source: &Output value
pt_br: Valor de &saída

# formPrincipal_menuItem_Biblioteca_Algoritmo
source: Encryption algorithm
pt_br: Algoritmo de criptografia

# formPrincipal_menuItem_Biblioteca_Clipboard
source: Send result to &clipboard
pt_br: Enviar resultado para área de &transferência

# formPrincipal_menuItem_Biblioteca_ClipboardControlVPassword
source: Binds the value of the password to clipboard
pt_br: Vincula o valor da senha com a área de transferência

# formPrincipal_menuItem_Biblioteca_ClipboardControlVValue
source: Binds the value of the input text to the clipboard
pt_br: Vincula o valor do texto de entrada com a área de transferência

# formPrincipal_menuItem_Biblioteca_Silent
source: Not display the &result
pt_br: Não exibir o &resultado

# formPrincipal_panelIconePassword_Hint
source: Enter here the password used\nto encrypt/decrypt the text.
pt_br: Digite aqui a senha usada para\ncriptografar/descriptografar o texto.

# formPrincipal_panelIconeValorEntrada_Hint
source: Enter here the text to\nbe encrypted/decrypted.
pt_br: Digite aqui o texto que\nserá criptografado/descriptografado.

# formPrincipal_panelIconeValorSaida_Hint
source: Here the result of the\nencryption/decryption\nprocess will be presented.\n\nThis just goes blank when\nattempting decryption fails\nbecause the text was not encrypted.
pt_br: Aqui será apresentado o resultado do\nprocesso de criptografia/descriptografia.\n\nEste campo apenas fica vazio quando a\ntentativa de descriptografia falha\npor causa do texto que não está criptografado.

# formPrincipal_radioButtonCrypt
source: &Encrypt
pt_br: &Criptografar

# formPrincipal_radioButtonCrypt_Hint
source: Enable this to encrypt the entered text.\n\nEven when no text is entered,\nan empty value will also be encrypted.
pt_br: Ative este para criptografar o texto inserido.\n\nMesmo quando nenhum texto é inserido,\no valor vazio também será criptografado.

# formPrincipal_radioButtonDecrypt_Hint
source: Enable this to decrypt the entered text.\n\nThe operation will be performed only\nif the entered text is encrypted.
pt_br: Ative este para descriptografar o texto inserido.\n\nA operação só será realizada se o texto\ninserido estiver criptografado.

# formPrincipal_radioButtonDescrypt
source: &Decrypt
pt_br: &Descriptografar

# msgAlgoritmoInvalido
source: Invalid encryption algorithm: {0}
pt_br: Algoritmo de criptografia inválido: {0}

# msgConflitoCryptDecrypt
source: Unable to determine the action: crypt or decrypt? (choose only one)
pt_br: Não foi possível determinar a ação: crypt ou decrypt? (escolha uma só)

# msgConflitoSenhaClipboard
source: Unable to determine the source of the password: informed value or clipboard? (choose only one)
pt_br: Não foi possível determinar a origem da senha: valor informado ou área de transferência? (escolha um só)

# msgConflitoValorClipboard
source: Unable to determine the soruce of the text: informed value or clipboard? (choose only one)
pt_br: Não foi possível determinar a origem do texto: valor informado ou área de transferência? (escolha um só)

# msgDescricao
source: The crypto command provides functions in the context\nof encryption for text strings.
pt_br: O comando crypto fornece funções no contexto\nda criptografia para sequências de texto.

# msgTextoNaoEstavaCriptografado
source: The text was not an encrypted value. Operation canceled.
pt_br: O texto não era um valor criptografado. Operação cancelada.

# optionAlgoritmoDeCriptografia
source: Symmetric encryption algorithm.\nValid options for VALUE:\n DES - uses 64-bit key\n RC2 - uses 128-bit key\n TripleDES - uses 192-bit key\n Rijndael - uses 256-bit key (default)
pt_br: Algoritmo de criptografia simétrica.\nOpções válidas para VALUE:\n DES - usa chave de 64 bits\n RC2 - usa chave de 128 bits\n TripleDES - usa chave de 192 bits\n Rijndael - usa chave de 256 bits (padrão)

# optionCriptografar
source: Action of encrypting (default)
pt_br: Ação de criptografar (padrão)

# optionDescriptografar
source: Action of decrypt
pt_br: Ação de descriptografar

# optionEnviarResultadoParaClipboard
source: Sends the result of encryption process to the clipboard
pt_br: Envia o resultado do processo de criptografia para a área de transferência

# optionInterfaceGrafica
source: Use graphical interface (GUI)
pt_br: Usa interface gráfica (GUI)

# optionModoSilencioso
source: Silent mode does not display the result of the encryption process
pt_br: Modo silencioso não exibe o resultado do processo de criptografia

# optionSenha
source: Password applied in the encryption process
pt_br: Senha aplicada no processo de criptografia

# optionSenhaComoClipboard
source: Get from clipboard the password applied in the encryption process
pt_br: Obtem da área de transferência a senha aplicada no processo de criptografia

# optionTextoComoClipboard
source: Get from clipboard the text to be manipulated
pt_br: Obtem da área de transferência o texto a ser manipulado

# optionTextoParaManipular
source: Text to be manipulated
pt_br: Texto que será manipulado
